#SWEA_1242_d5-암호코드스캔

from collections import deque
import sys
sys.stdin = open('input.txt')
'''
@문제 푸는 순서
1. 배열에서 예비 암호코드 긁어오기
2. 16진수를 2진수로 변환하기
    - 이때, 7로 나눠서 비율을 구하고
    - 그 비율을 만큼 건너 뛰면서 값 긁어오기기
. 검증코드가 적절한지 검사하기


1DB1 76C5 88D2 6EC
00 0111011 0110001 0111011 0110001 0110001 0001101 0010011 0111011 00
   0111011 0110001 0111011 0110001 0110001 0001101 0010011 0111011
   7       5       7       5       5       0       2       7
   (7+7+5+2 * 3) + (5+5+0+7) = 63 + 17 = 80
196E BC5A 316C 578
0 0011001 0110111 0101111 0001011 0100011 0001011 0110001 0101111 000
  1       8       6       9       4       9       5       6       
  (1+6+4+5 * 3) + (8+9+9+6) = 48 + 32 == 80
328D 1AF6 E4C9 BB
0011001 0100011 0100011 0101111 0110111 0010011 0010011 0111011
1       4       4       6       8       2       2       7
(1+4+8+2 * 3) + (4+6+2+7) = 45 + 19 = 64
'''



# 16진수를 2진수로 변환하는 함수
def change(string):
    return string
# 검증코드가 맞는지 검사하는 함수
def code_search():
    pass

for t in range(int(input())):
    sol = ""
    dict1 = {
        '0': '0000',
        '1': '0001',
        '2': '0010',
        '3': '0011',
        '4': '0100',
        '5': '0101',
        '6': '0110',
        '7': '0111',
        '8': '1000',
        '9': '1001',
        'A': '1010',
        'B': '1011',
        'C': '1100',
        'D': '1101',
        'E': '1110',
        'F': '1111',
    }
    dict2 = {
        '0001101': 0,
        '0011001': 1,
        '0010011': 2,
        '0111101': 3,
        '0100011': 4,
        '0110001': 5,
        '0101111': 6,
        '0111011': 7,
        '0110111': 8,
        '0001011': 9,
    }

    N, M = map(int, input().split())
    set1 = set()
    set_sol = set()
    lst_sol = []
    for i in range(N):
        sol = ""
        s = input()
        s = s.rstrip('0').rstrip('0')
        if s == "":
            continue

        if s in set1:                   # 이미 들어왔던 16진수이면 패스
            continue
        else:                           # 아니면 셋이 넣어주고 진행
            set1.add(s)

        for j in s:                     # 16진수 만들고 set에 추가
            sol += dict1[j]
        sol = sol.rstrip('0')
        sol = sol[::-1]
        sol = sol[:56]
        sol = sol[::-1]
        for j in range(0,56,7):
            lst_sol.append(sol[j:j+7])
        for i in lst_sol:
            print(dict2[i])
        set_sol.add(sol)


# 01110110110001011101101100010110001000110100100110111011
# 11011011000101110110110001011000100011010010011011101100