# BOJ_1193_bronze1-분수찾기

'''
1 + 2 + 3 + 4 + 5 + ...
k번째 ?
K - 1 -2 -3 -4 -...
k가 언제 0보다 작아지니
K = 43
K - 1 - 2 - 3 - 4 - 5 - 6 - 7 - 8 - 9
n = 9 => k = -2 => k + 9 = 7
답 : k/(n+1-k) => 7/10-3

k = 9
k - 1 - 2 - 3 - 4  
n = 4 => k = -1 => k + 4 = 3
답 : k/(n+1-k)

k = 1
k - 1
n = 1 => k = 0 => k + 1 = 1
답 : k/(n+1-k)
'''
k = int(input())
n = 0
while k > 0:
    n += 1
    k -= n
k += n
if n % 2 == 0:              # 큰 수 / 작은 수 시작
    mo = n+1-k
    ja = k
else:                       # 작은 수 / 큰 수 시작
    mo = k
    ja = n+1-k
print(f'{ja}/{mo}')
