#1 (틀림)

# (1) '가흔의 지역은 서울입니다.'   O
# (2) '오류.'                       X   =>  정상 실행
# (3) '지우의 지역은 서울입니다.'   O
# (4) '승호의 지역은 광주입니다.'   X    => 오류 발생


# #2

# def my_age(*lst):
#     sum = 0     
#     for i in lst:
#         sum += i
#     return sum / len(lst)

# avg = my_age(77, 83, 95, 80, 70)
# print(avg)

## cnt가 0일때도 고려해줘야함을 충분히 인지하여 경우를 모두 따져줘야함!! 

#3

# None
# my_func함수는 return값이 존재하지 않기 때문에 result 변수는 어떠한 값도 받지 못한다.

#4

# 총 4가지의 scope가 존재한다
# 1. local scope                : 현재 작업 중인 범위
# 2. Enclosed scope (기억안남)   : local 한 단계 위 범위
# 3. global scope               : 최상단에 위치한 범위
# 4. built-in scope             : 모든 것을 담고 있는 범위

#5 

# (1) 가능하다
# (2) 맞다
# (3) 맞다
# (4) 맞다

#6

# 재귀 함수를 사용했을 때 얻을 수 있는 장점으로는 코딩을 간결하게 할 수 있다.
# 재귀 함수를 사용했을 때의 단점은 반복문에 비교하여 제 3자로 하여금 이해하기 힘들 수 있다.
# 또한, 반복문에 비해 용량이 크다.


# 재귀 함수의 장점 => 직관적임, 느림(함수호출하는 과정이 추가되기 떄문에)
